# Parameter Type Id Rebar Crank At Start Type Property

Source: https://www.revitapidocs.com/2026/bb0c5c1e-83d2-7fb5-5ce1-3e497a89fae4.htm

---

| Parameter Type Id Rebar Crank At Start Type Property |
| --- |

"Crank at Start"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarCrankAtStartType { get; }
```

```
Public Shared ReadOnly Property RebarCrankAtStartType As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarCrankAtStartType {
	ForgeTypeId^ get ();
}
```

```
static member RebarCrankAtStartType : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace